7767517
143 159
Input            images                   0 1 images
Convolution      Conv_0                   1 1 images 627 0=24 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=648
ReLU             Relu_1                   1 1 627 340
Pooling          MaxPool_2                1 1 340 341 0=0 1=3 11=3 2=2 12=2 3=1 13=1 14=1 15=1 5=1
Split            splitncnn_0              1 2 341 341_splitncnn_0 341_splitncnn_1
ConvolutionDepthWise Conv_3                   1 1 341_splitncnn_1 630 0=24 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=216 7=24
Convolution      Conv_4                   1 1 630 633 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
ReLU             Relu_5                   1 1 633 346
Convolution      Conv_6                   1 1 341_splitncnn_0 636 0=58 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1392
ReLU             Relu_7                   1 1 636 349
ConvolutionDepthWise Conv_8                   1 1 349 639 0=58 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=522 7=58
Convolution      Conv_9                   1 1 639 642 0=92 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=5336
ReLU             Relu_10                  1 1 642 354
Concat           Concat_11                2 1 346 354 355 0=0
ShuffleChannel   Reshape_16               1 1 355 360 0=2 1=1
Slice            Gather_20                1 2 360 362 364 -23300=2,-233,-233 1=0
Convolution      Conv_21                  1 1 364 645 0=58 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3364
ReLU             Relu_22                  1 1 645 367
ConvolutionDepthWise Conv_23                  1 1 367 648 0=58 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=522 7=58
Convolution      Conv_24                  1 1 648 651 0=58 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3364
ReLU             Relu_25                  1 1 651 372
Concat           Concat_26                2 1 362 372 373 0=0
ShuffleChannel   Reshape_31               1 1 373 378 0=2 1=1
Slice            Gather_35                1 2 378 380 382 -23300=2,-233,-233 1=0
Convolution      Conv_36                  1 1 382 654 0=58 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3364
ReLU             Relu_37                  1 1 654 385
ConvolutionDepthWise Conv_38                  1 1 385 657 0=58 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=522 7=58
Convolution      Conv_39                  1 1 657 660 0=58 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3364
ReLU             Relu_40                  1 1 660 390
Concat           Concat_41                2 1 380 390 391 0=0
ShuffleChannel   Reshape_46               1 1 391 396 0=2 1=1
Slice            Gather_50                1 2 396 398 400 -23300=2,-233,-233 1=0
Convolution      Conv_51                  1 1 400 663 0=58 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3364
ReLU             Relu_52                  1 1 663 403
ConvolutionDepthWise Conv_53                  1 1 403 666 0=58 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=522 7=58
Convolution      Conv_54                  1 1 666 669 0=58 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3364
ReLU             Relu_55                  1 1 669 408
Concat           Concat_56                2 1 398 408 409 0=0
Split            splitncnn_1              1 2 409 409_splitncnn_0 409_splitncnn_1
ConvolutionDepthWise Conv_57                  1 1 409_splitncnn_1 672 0=116 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1044 7=116
Convolution      Conv_58                  1 1 672 675 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=13456
ReLU             Relu_59                  1 1 675 414
Convolution      Conv_60                  1 1 409_splitncnn_0 678 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=13456
ReLU             Relu_61                  1 1 678 417
ConvolutionDepthWise Conv_62                  1 1 417 681 0=116 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1044 7=116
Convolution      Conv_63                  1 1 681 684 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=13456
ReLU             Relu_64                  1 1 684 422
Concat           Concat_65                2 1 414 422 423 0=0
ShuffleChannel   Reshape_70               1 1 423 428 0=2 1=1
Slice            Gather_74                1 2 428 430 432 -23300=2,-233,-233 1=0
Convolution      Conv_75                  1 1 432 687 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=13456
ReLU             Relu_76                  1 1 687 435
ConvolutionDepthWise Conv_77                  1 1 435 690 0=116 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1044 7=116
Convolution      Conv_78                  1 1 690 693 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=13456
ReLU             Relu_79                  1 1 693 440
Concat           Concat_80                2 1 430 440 441 0=0
ShuffleChannel   Reshape_85               1 1 441 446 0=2 1=1
Slice            Gather_89                1 2 446 448 450 -23300=2,-233,-233 1=0
Convolution      Conv_90                  1 1 450 696 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=13456
ReLU             Relu_91                  1 1 696 453
ConvolutionDepthWise Conv_92                  1 1 453 699 0=116 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1044 7=116
Convolution      Conv_93                  1 1 699 702 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=13456
ReLU             Relu_94                  1 1 702 458
Concat           Concat_95                2 1 448 458 459 0=0
ShuffleChannel   Reshape_100              1 1 459 464 0=2 1=1
Slice            Gather_104               1 2 464 466 468 -23300=2,-233,-233 1=0
Convolution      Conv_105                 1 1 468 705 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=13456
ReLU             Relu_106                 1 1 705 471
ConvolutionDepthWise Conv_107                 1 1 471 708 0=116 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1044 7=116
Convolution      Conv_108                 1 1 708 711 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=13456
ReLU             Relu_109                 1 1 711 476
Concat           Concat_110               2 1 466 476 477 0=0
ShuffleChannel   Reshape_115              1 1 477 482 0=2 1=1
Slice            Gather_119               1 2 482 484 486 -23300=2,-233,-233 1=0
Convolution      Conv_120                 1 1 486 714 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=13456
ReLU             Relu_121                 1 1 714 489
ConvolutionDepthWise Conv_122                 1 1 489 717 0=116 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1044 7=116
Convolution      Conv_123                 1 1 717 720 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=13456
ReLU             Relu_124                 1 1 720 494
Concat           Concat_125               2 1 484 494 495 0=0
ShuffleChannel   Reshape_130              1 1 495 500 0=2 1=1
Slice            Gather_134               1 2 500 502 504 -23300=2,-233,-233 1=0
Convolution      Conv_135                 1 1 504 723 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=13456
ReLU             Relu_136                 1 1 723 507
ConvolutionDepthWise Conv_137                 1 1 507 726 0=116 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1044 7=116
Convolution      Conv_138                 1 1 726 729 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=13456
ReLU             Relu_139                 1 1 729 512
Concat           Concat_140               2 1 502 512 513 0=0
ShuffleChannel   Reshape_145              1 1 513 518 0=2 1=1
Slice            Gather_149               1 2 518 520 522 -23300=2,-233,-233 1=0
Convolution      Conv_150                 1 1 522 732 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=13456
ReLU             Relu_151                 1 1 732 525
ConvolutionDepthWise Conv_152                 1 1 525 735 0=116 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1044 7=116
Convolution      Conv_153                 1 1 735 738 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=13456
ReLU             Relu_154                 1 1 738 530
Concat           Concat_155               2 1 520 530 531 0=0
ShuffleChannel   Reshape_160              1 1 531 536 0=2 1=1
Slice            Gather_164               1 2 536 538 540 -23300=2,-233,-233 1=0
Convolution      Conv_165                 1 1 540 741 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=13456
ReLU             Relu_166                 1 1 741 543
ConvolutionDepthWise Conv_167                 1 1 543 744 0=116 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1044 7=116
Convolution      Conv_168                 1 1 744 747 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=13456
ReLU             Relu_169                 1 1 747 548
Concat           Concat_170               2 1 538 548 549 0=0
Split            splitncnn_2              1 2 549 549_splitncnn_0 549_splitncnn_1
ConvolutionDepthWise Conv_171                 1 1 549_splitncnn_1 750 0=232 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=2088 7=232
Convolution      Conv_172                 1 1 750 753 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=53824
ReLU             Relu_173                 1 1 753 554
Convolution      Conv_174                 1 1 549_splitncnn_0 756 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=53824
ReLU             Relu_175                 1 1 756 557
ConvolutionDepthWise Conv_176                 1 1 557 759 0=232 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=2088 7=232
Convolution      Conv_177                 1 1 759 762 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=53824
ReLU             Relu_178                 1 1 762 562
Concat           Concat_179               2 1 554 562 563 0=0
ShuffleChannel   Reshape_184              1 1 563 568 0=2 1=1
Slice            Gather_188               1 2 568 570 572 -23300=2,-233,-233 1=0
Convolution      Conv_189                 1 1 572 765 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=53824
ReLU             Relu_190                 1 1 765 575
ConvolutionDepthWise Conv_191                 1 1 575 768 0=232 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2088 7=232
Convolution      Conv_192                 1 1 768 771 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=53824
ReLU             Relu_193                 1 1 771 580
Concat           Concat_194               2 1 570 580 581 0=0
ShuffleChannel   Reshape_199              1 1 581 586 0=2 1=1
Slice            Gather_203               1 2 586 588 590 -23300=2,-233,-233 1=0
Convolution      Conv_204                 1 1 590 774 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=53824
ReLU             Relu_205                 1 1 774 593
ConvolutionDepthWise Conv_206                 1 1 593 777 0=232 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2088 7=232
Convolution      Conv_207                 1 1 777 780 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=53824
ReLU             Relu_208                 1 1 780 598
Concat           Concat_209               2 1 588 598 599 0=0
ShuffleChannel   Reshape_214              1 1 599 604 0=2 1=1
Slice            Gather_218               1 2 604 606 608 -23300=2,-233,-233 1=0
Convolution      Conv_219                 1 1 608 783 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=53824
ReLU             Relu_220                 1 1 783 611
ConvolutionDepthWise Conv_221                 1 1 611 786 0=232 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2088 7=232
Convolution      Conv_222                 1 1 786 789 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=53824
ReLU             Relu_223                 1 1 789 616
Concat           Concat_224               2 1 606 616 617 0=0
Convolution      Conv_225                 1 1 617 792 0=1024 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=475136
ReLU             Relu_226                 1 1 792 620
Pooling          AveragePool_228          1 1 620 622 0=1 1=4 11=4 2=4 12=4 3=0 13=0 14=0 15=0 5=1 6=0
Reshape          Reshape_230              1 1 622 624 0=1024
InnerProduct     MatMul_231               1 1 624 output 0=16 1=0 2=16384
